In [14]:
import pandas as pd
import os
json_file = os.path.join("purchase_data.json")

In [15]:
purchase_data_df = pd.read_json(json_file)

In [16]:
purchase_data_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [17]:
number_of_players = len(purchase_data_df["SN"].unique())
number_of_players

573

In [18]:
number_of_unique_items = len(purchase_data_df["Item Name"].unique())
number_of_unique_items

179

In [19]:
average_purchase_price = purchase_data_df["Price"].mean()
average_purchase_price

2.931192307692303

In [20]:
total_number_purchases = len(purchase_data_df)
total_number_purchases

780

In [21]:
total_revenue = purchase_data_df["Price"].sum()
total_revenue

2286.3299999999963

In [22]:
gender_demo_male = purchase_data_df.loc[purchase_data_df["Gender"] == 'Male']
gender_demo_male.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [23]:
gender_demo_male_dropdup = gender_demo_male.drop_duplicates("SN", keep='last')
gender_demo_male_dropdup.head()

,Age,Gender,Item ID,Item Name,Price,SN
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59
5,20,Male,10,Sleepwalker,1.73,Tanimnya91
6,20,Male,153,Mercenary Sabre,4.57,Undjaskla97

In [25]:
number_of_uniq_male = len(gender_demo_male_dropdup)
number_of_uniq_male

465

In [26]:
percentage_of_males = number_of_uniq_male/number_of_players
percentage_of_males

0.8115183246073299

In [27]:
gender_demo_female = purchase_data_df.loc[purchase_data_df["Gender"] == 'Female']
gender_demo_female.head()

,Age,Gender,Item ID,Item Name,Price,SN
7,29,Female,169,"Interrogator, Blood Blade of the Queen",3.32,Iathenudil29
16,22,Female,123,Twilight's Carver,1.14,Sundista85
17,22,Female,59,"Lightning, Etcher of the King",1.65,Aenarap34
22,11,Female,11,Brimstone,2.52,Deural48
29,16,Female,45,Glinting Glass Edge,2.46,Phaedai25

In [28]:
gender_demo_female_dropdup = gender_demo_female.drop_duplicates("SN", keep='last')
gender_demo_female_dropdup.head()

    Age  Gender  Item ID                      Item Name  Price          SN
16   22  Female      123              Twilight's Carver   1.14  Sundista85
17   22  Female       59  Lightning, Etcher of the King   1.65   Aenarap34
29   16  Female       45            Glinting Glass Edge   2.46   Phaedai25
30   21  Female      155      War-Forged Gold Deflector   3.73  Eulaeria40
35   21  Female       13                       Serenity   1.49     Aisur51

In [29]:
number_of_uniq_females = len(gender_demo_female_dropdup)
number_of_uniq_females

100

In [30]:
percentage_of_females = number_of_uniq_females/number_of_players
percentage_of_females

0.17452006980802792

In [31]:
gender_demo_other = purchase_data_df.loc[(purchase_data_df["Gender"] != 'Female') & (purchase_data_df["Gender"] != 'Male')]
gender_demo_other.head()

,Age,Gender,Item ID,Item Name,Price,SN
177,34,Other / Non-Disclosed,155,War-Forged Gold Deflector,3.73,Assassa38
209,33,Other / Non-Disclosed,157,"Spada, Etcher of Hatred",2.21,Frichistasta59
244,21,Other / Non-Disclosed,183,Dragon's Greatsword,2.36,Tyaerith73
267,33,Other / Non-Disclosed,65,Conqueror Adamantite Mace,1.96,Frichistasta59
276,12,Other / Non-Disclosed,128,"Blazeguard, Reach of Eternity",4.00,Aillycal84

In [32]:
gender_demo_other_dropdup = gender_demo_other.drop_duplicates("SN", keep='last')
gender_demo_other_dropdup.head()

,Age,Gender,Item ID,Item Name,Price,SN
244,21,Other / Non-Disclosed,183,Dragon's Greatsword,2.36,Tyaerith73
267,33,Other / Non-Disclosed,65,Conqueror Adamantite Mace,1.96,Frichistasta59
276,12,Other / Non-Disclosed,128,"Blazeguard, Reach of Eternity",4.00,Aillycal84
298,26,Other / Non-Disclosed,141,Persuasion,3.27,Faralcil63
423,32,Other / Non-Disclosed,29,"Chaos, Ender of the End",3.79,Aithelis62

In [33]:
number_of_uniq_other = len(gender_demo_other_dropdup)
number_of_uniq_other

8

In [34]:
percentage_of_other = number_of_uniq_other/number_of_players
percentage_of_other

0.013961605584642234

In [35]:
total_purchases_male = len(gender_demo_male)
total_purchases_male

633

In [36]:
average_purchaseprice_male = gender_demo_male['Price'].mean()
average_purchaseprice_male

2.9505213270142154

In [37]:
total_purchasevalue_male = gender_demo_male['Price'].sum()
total_purchasevalue_male

1867.6799999999985

In [38]:
#insert normalization here

In [39]:
#insert normalization here

In [40]:
total_purchases_female = len(gender_demo_female)
total_purchases_female

136

In [41]:
average_purchaseprice_female = gender_demo_female['Price'].mean()
average_purchaseprice_female

2.815514705882352

In [42]:
total_purchasevalue_female = gender_demo_female['Price'].sum()
total_purchasevalue_female

382.90999999999985

In [43]:
#insert normalization here

In [44]:
#insert normalization here

In [45]:
total_purchases_other = len(gender_demo_other)
total_purchases_other

11

In [46]:
average_purchaseprice_other = gender_demo_other['Price'].mean()
average_purchaseprice_other

3.2490909090909086

In [47]:
total_purchasevalue_other = gender_demo_other['Price'].sum()
total_purchasevalue_other

35.739999999999995

In [48]:
purchase_data_df['Age'].min()

7

In [49]:
purchase_data_df['Age'].max()

45

In [50]:
bins = [0, 18, 24, 36, 48]
group_names = ['Minors/Teen <18', 'Young Adult 18-24', 'Adult 24-36', 'Older Adult 36+']
purchase_data_df['Age Demographic'] = pd.cut(purchase_data_df['Age'], bins, labels=group_names)

In [51]:
purchase_data_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age Demographic
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,Older Adult 36+
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,Young Adult 18-24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,Adult 24-36
3,21,Male,92,Final Critic,1.36,Pheusrical25,Young Adult 18-24
4,23,Male,63,Stormfury Mace,1.27,Aela59,Young Adult 18-24

In [52]:
age_demographics_purchases = purchase_data_df.groupby(['Age Demographic'])
pd.DataFrame(age_demographics_purchases['Age'].count().rename('Purchase Count'))

                   Purchase Count
Age Demographic
Adult 24-36                   208
Minors/Teen <18               174
Older Adult 36+                40
Young Adult 18-24             358

In [53]:
pd.DataFrame(age_demographics_purchases['Price'].mean().rename('Average Purchase Price'))

                   Average Purchase Price
Age Demographic
Adult 24-36                      3.003558
Minors/Teen <18                  2.872011
Older Adult 36+                  2.899750
Young Adult 18-24                2.921425

In [54]:
pd.DataFrame(age_demographics_purchases['Price'].sum().rename('Total Purchase Value'))

                   Total Purchase Value
Age Demographic
Adult 24-36                      624.74
Minors/Teen <18                  499.73
Older Adult 36+                  115.99
Young Adult 18-24               1045.87

In [60]:
top_spenders = purchase_data_df.groupby(['SN'])
top5_spenders_sum_df = top_spenders[['Price']].sum().sort_values(['Price'],ascending=False).rename(columns={'Price':'Total Spent'}).head().reset_index(drop=False)

top5_spenders_sum_df

            SN  Total Spent
0  Undirrala66        17.06
1     Saedue76        13.56
2  Mindimnya67        12.74
3   Haellysu29        12.73
4       Eoda93        11.58

In [61]:
top_spenders_mean = top_spenders['Price'].mean()
top_spenders_mean_df = pd.DataFrame(top_spenders_mean).rename(columns={'Price': 'Average Spent'}).reset_index(drop=False)
top_spenders_mean_df.head()

             SN  Average Spent
0  Adairialis76       2.460000
1    Aduephos78       2.233333
2     Aeduera68       1.933333
3        Aela49       2.460000
4        Aela59       1.270000

In [62]:
merge_tables = pd.merge(top5_spenders_sum_df, top_spenders_mean_df, on='SN')
merge_tables

            SN  Total Spent  Average Spent
0  Undirrala66        17.06       3.412000
1     Saedue76        13.56       3.390000
2  Mindimnya67        12.74       3.185000
3   Haellysu29        12.73       4.243333
4       Eoda93        11.58       3.860000

In [63]:
top_spenders_purchases = top_spenders['SN'].count()
top_spenders_purchases_df = pd.DataFrame(top_spenders_purchases).rename(columns={'SN':'Number of Purchases'}).reset_index(drop=False)
top_spenders_purchases_df.head()

             SN  Number of Purchases
0  Adairialis76                    1
1    Aduephos78                    3
2     Aeduera68                    3
3        Aela49                    1
4        Aela59                    1

In [73]:
top_spenders_merge_tables_df = pd.merge(merge_tables, top_spenders_purchases_df, on='SN')
top_spenders_merge_tables_df

            SN  Total Spent  Average Spent  Number of Purchases
0  Undirrala66        17.06       3.412000                    5
1     Saedue76        13.56       3.390000                    4
2  Mindimnya67        12.74       3.185000                    4
3   Haellysu29        12.73       4.243333                    3
4       Eoda93        11.58       3.860000                    3

In [131]:
popular_items = purchase_data_df.groupby(['Item ID', 'Item Name','Price'])

popular_items_df = popular_items[['Age']].count().sort_values(['Age'],ascending=False).rename(columns={'Age':'Purchase Count'}).head().reset_index(drop=False)
popular_items_df
#popular_items.sort_values(['Age'], ascending=False)

   Item ID                             Item Name  Price  Purchase Count
0       39  Betrayal, Whisper of Grieving Widows   2.35              11
1       84                            Arcane Gem   2.23              11
2       31                             Trickster   2.07               9
3      175            Woeful Adamantite Claymore   1.24               9
4       13                              Serenity   1.49               9

In [132]:
popular_items_sum = popular_items[['Price']].sum().rename(columns={'Price':'Total Purchase Value'}).reset_index(drop=False)
popular_items_sum.head()

#top_spenders = purchase_data_df.groupby(['SN'])
#top5_spenders_sum_df = top_spenders[['Price']].sum().sort_values(['Price'],ascending=False).rename(columns={'Price':'Total Spent'}).head().reset_index(drop=False)

   Item ID           Item Name  Price  Total Purchase Value
0        0            Splinter   1.82                  1.82
1        1            Crucifer   2.28                  9.12
2        2             Verdict   3.40                  3.40
3        3        Phantomlight   1.79                  1.79
4        4  Bloodlord's Fetish   2.28                  2.28

In [136]:
popular_items_merge_df = pd.merge(popular_items_df, popular_items_sum, on=['Item Name', 'Item ID', 'Price'])
popular_items_merge_df

,Item ID,Item Name,Price,Purchase Count,Total Purchase Value
0,39,"Betrayal, Whisper of Grieving Widows",2.35,11,25.85
1,84,Arcane Gem,2.23,11,24.53
2,31,Trickster,2.07,9,18.63
3,175,Woeful Adamantite Claymore,1.24,9,11.16
4,13,Serenity,1.49,9,13.41